Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP512GM710.h
/* RPOR7 */
#define _RP56R RPOR7bits.RP56R
#define _RP57R RPOR7bits.RP57R
#define _RP56R0 RPOR7bits.RP56R0
#define _RP56R1 RPOR7bits.RP56R1
#define _RP56R2 RPOR7bits.RP56R2
#define _RP56R3 RPOR7bits.RP56R3
#define _RP56R4 RPOR7bits.RP56R4
#define _RP56R5 RPOR7bits.RP56R5
#define _RP57R0 RPOR7bits.RP57R0
#define _RP57R1 RPOR7bits.RP57R1
#define _RP57R2 RPOR7bits.RP57R2
#define _RP57R3 RPOR7bits.RP57R3
#define _RP57R4 RPOR7bits.RP57R4
#define _RP57R5 RPOR7bits.RP57R5

/* RPOR8 */
#define _RP69R RPOR8bits.RP69R
#define _RP70R RPOR8bits.RP70R
#define _RP69R0 RPOR8bits.RP69R0
#define _RP69R1 RPOR8bits.RP69R1
#define _RP69R2 RPOR8bits.RP69R2
#define _RP69R3 RPOR8bits.RP69R3
#define _RP69R4 RPOR8bits.RP69R4
#define _RP69R5 RPOR8bits.RP69R5
#define _RP70R0 RPOR8bits.RP70R0
#define _RP70R1 RPOR8bits.RP70R1
#define _RP70R2 RPOR8bits.RP70R2
#define _RP70R3 RPOR8bits.RP70R3
#define _RP70R4 RPOR8bits.RP70R4
#define _RP70R5 RPOR8bits.RP70R5

/* RPOR9 */
#define _RP81R RPOR9bits.RP81R
#define _RP97R RPOR9bits.RP97R
#define _RP81R0 RPOR9bits.RP81R0
#define _RP81R1 RPOR9bits.RP81R1
#define _RP81R2 RPOR9bits.RP81R2
#define _RP81R3 RPOR9bits.RP81R3
#define _RP81R4 RPOR9bits.RP81R4
#define _RP81R5 RPOR9bits.RP81R5
#define _RP97R0 RPOR9bits.RP97R0
#define _RP97R1 RPOR9bits.RP97R1
#define _RP97R2 RPOR9bits.RP97R2
#define _RP97R3 RPOR9bits.RP97R3
#define _RP97R4 RPOR9bits.RP97R4
#define _RP97R5 RPOR9bits.RP97R5

/* RPOR10 */
#define _RP113R RPOR10bits.RP113R
#define _RP118R RPOR10bits.RP118R
#define _RP113R0 RPOR10bits.RP113R0
#define _RP113R1 RPOR10bits.RP113R1
#define _RP113R2 RPOR10bits.RP113R2
#define _RP113R3 RPOR10bits.RP113R3
#define _RP113R4 RPOR10bits.RP113R4
#define _RP113R5 RPOR10bits.RP113R5
#define _RP118R0 RPOR10bits.RP118R0
#define _RP118R1 RPOR10bits.RP118R1
#define _RP118R2 RPOR10bits.RP118R2
#define _RP118R3 RPOR10bits.RP118R3
#define _RP118R4 RPOR10bits.RP118R4
#define _RP118R5 RPOR10bits.RP118R5

/* RPOR11 */
#define _RP120R RPOR11bits.RP120R
#define _RP125R RPOR11bits.RP125R
#define _RP120R0 RPOR11bits.RP120R0
#define _RP120R1 RPOR11bits.RP120R1
#define _RP120R2 RPOR11bits.RP120R2
#define _RP120R3 RPOR11bits.RP120R3
#define _RP120R4 RPOR11bits.RP120R4
#define _RP120R5 RPOR11bits.RP120R5
#define _RP125R0 RPOR11bits.RP125R0
#define _RP125R1 RPOR11bits.RP125R1
#define _RP125R2 RPOR11bits.RP125R2
#define _RP125R3 RPOR11bits.RP125R3
#define _RP125R4 RPOR11bits.RP125R4
#define _RP125R5 RPOR11bits.RP125R5

/* RPOR12 */
#define _RP126R RPOR12bits.RP126R
#define _RP127R RPOR12bits.RP127R
#define _RP126R0 RPOR12bits.RP126R0
#define _RP126R1 RPOR12bits.RP126R1
#define _RP126R2 RPOR12bits.RP126R2
#define _RP126R3 RPOR12bits.RP126R3
#define _RP126R4 RPOR12bits.RP126R4
#define _RP126R5 RPOR12bits.RP126R5
#define _RP127R0 RPOR12bits.RP127R0
#define _RP127R1 RPOR12bits.RP127R1
#define _RP127R2 RPOR12bits.RP127R2
#define _RP127R3 RPOR12bits.RP127R3
#define _RP127R4 RPOR12bits.RP127R4
#define _RP127R5 RPOR12bits.RP127R5

/* RPINR0 */
#define _INT1R RPINR0bits.INT1R
#define _INT1R0 RPINR0bits.INT1R0
#define _INT1R1 RPINR0bits.INT1R1
#define _INT1R2 RPINR0bits.INT1R2
#define _INT1R3 RPINR0bits.INT1R3
#define _INT1R4 RPINR0bits.INT1R4
#define _INT1R5 RPINR0bits.INT1R5
#define _INT1R6 RPINR0bits.INT1R6

/* RPINR1 */
#define _INT2R RPINR1bits.INT2R
#define _INT2R0 RPINR1bits.INT2R0
#define _INT2R1 RPINR1bits.INT2R1
#define _INT2R2 RPINR1bits.INT2R2
#define _INT2R3 RPINR1bits.INT2R3
#define _INT2R4 RPINR1bits.INT2R4
#define _INT2R5 RPINR1bits.INT2R5
#define _INT2R6 RPINR1bits.INT2R6

/* RPINR3 */
#define _T2CKR RPINR3bits.T2CKR
#define _T2CKR0 RPINR3bits.T2CKR0
#define _T2CKR1 RPINR3bits.T2CKR1
#define _T2CKR2 RPINR3bits.T2CKR2
#define _T2CKR3 RPINR3bits.T2CKR3
#define _T2CKR4 RPINR3bits.T2CKR4
#define _T2CKR5 RPINR3bits.T2CKR5
#define _T2CKR6 RPINR3bits.T2CKR6

/* RPINR7 */
#define _IC1R RPINR7bits.IC1R
#define _IC2R RPINR7bits.IC2R
#define _IC1R0 RPINR7bits.IC1R0
#define _IC1R1 RPINR7bits.IC1R1
#define _IC1R2 RPINR7bits.IC1R2
#define _IC1R3 RPINR7bits.IC1R3
#define _IC1R4 RPINR7bits.IC1R4
#define _IC1R5 RPINR7bits.IC1R5
#define _IC1R6 RPINR7bits.IC1R6
#define _IC2R0 RPINR7bits.IC2R0
#define _IC2R1 RPINR7bits.IC2R1
#define _IC2R2 RPINR7bits.IC2R2
#define _IC2R3 RPINR7bits.IC2R3
#define _IC2R4 RPINR7bits.IC2R4
#define _IC2R5 RPINR7bits.IC2R5
#define _IC2R6 RPINR7bits.IC2R6

/* RPINR8 */
#define _IC3R RPINR8bits.IC3R
#define _IC4R RPINR8bits.IC4R
#define _IC3R0 RPINR8bits.IC3R0
#define _IC3R1 RPINR8bits.IC3R1
#define _IC3R2 RPINR8bits.IC3R2
#define _IC3R3 RPINR8bits.IC3R3
#define _IC3R4 RPINR8bits.IC3R4
#define _IC3R5 RPINR8bits.IC3R5
#define _IC3R6 RPINR8bits.IC3R6
#define _IC4R0 RPINR8bits.IC4R0
#define _IC4R1 RPINR8bits.IC4R1
#define _IC4R2 RPINR8bits.IC4R2
#define _IC4R3 RPINR8bits.IC4R3
#define _IC4R4 RPINR8bits.IC4R4
#define _IC4R5 RPINR8bits.IC4R5
#define _IC4R6 RPINR8bits.IC4R6

/* RPINR9 */
#define _IC5R RPINR9bits.IC5R
#define _IC6R RPINR9bits.IC6R
#define _IC5R0 RPINR9bits.IC5R0
#define _IC5R1 RPINR9bits.IC5R1
#define _IC5R2 RPINR9bits.IC5R2
#define _IC5R3 RPINR9bits.IC5R3
#define _IC5R4 RPINR9bits.IC5R4
#define _IC5R5 RPINR9bits.IC5R5
#define _IC5R6 RPINR9bits.IC5R6
#define _IC6R0 RPINR9bits.IC6R0
#define _IC6R1 RPINR9bits.IC6R1
#define _IC6R2 RPINR9bits.IC6R2
#define _IC6R3 RPINR9bits.IC6R3
#define _IC6R4 RPINR9bits.IC6R4
#define _IC6R5 RPINR9bits.IC6R5
#define _IC6R6 RPINR9bits.IC6R6

/* RPINR10 */
#define _IC7R RPINR10bits.IC7R
#define _IC8R RPINR10bits.IC8R
#define _IC7R0 RPINR10bits.IC7R0
#define _IC7R1 RPINR10bits.IC7R1
#define _IC7R2 RPINR10bits.IC7R2
#define _IC7R3 RPINR10bits.IC7R3
#define _IC7R4 RPINR10bits.IC7R4
#define _IC7R5 RPINR10bits.IC7R5
#define _IC7R6 RPINR10bits.IC7R6
#define _IC8R0 RPINR10bits.IC8R0
#define _IC8R1 RPINR10bits.IC8R1
#define _IC8R2 RPINR10bits.IC8R2
#define _IC8R3 RPINR10bits.IC8R3
#define _IC8R4 RPINR10bits.IC8R4
#define _IC8R5 RPINR10bits.IC8R5
#define _IC8R6 RPINR10bits.IC8R6

/* RPINR11 */
#define _OCFAR RPINR11bits.OCFAR
#define _OCFAR0 RPINR11bits.OCFAR0
#define _OCFAR1 RPINR11bits.OCFAR1
#define _OCFAR2 RPINR11bits.OCFAR2
#define _OCFAR3 RPINR11bits.OCFAR3
#define _OCFAR4 RPINR11bits.OCFAR4
#define _OCFAR5 RPINR11bits.OCFAR5
#define _OCFAR6 RPINR11bits.OCFAR6

