Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP512GM710.h
#define _RPOR10_RP113R3_POSITION                 0x00000003
#define _RPOR10_RP113R3_MASK                     0x00000008
#define _RPOR10_RP113R3_LENGTH                   0x00000001

#define _RPOR10_RP113R4_POSITION                 0x00000004
#define _RPOR10_RP113R4_MASK                     0x00000010
#define _RPOR10_RP113R4_LENGTH                   0x00000001

#define _RPOR10_RP113R5_POSITION                 0x00000005
#define _RPOR10_RP113R5_MASK                     0x00000020
#define _RPOR10_RP113R5_LENGTH                   0x00000001

#define _RPOR10_RP118R0_POSITION                 0x00000008
#define _RPOR10_RP118R0_MASK                     0x00000100
#define _RPOR10_RP118R0_LENGTH                   0x00000001

#define _RPOR10_RP118R1_POSITION                 0x00000009
#define _RPOR10_RP118R1_MASK                     0x00000200
#define _RPOR10_RP118R1_LENGTH                   0x00000001

#define _RPOR10_RP118R2_POSITION                 0x0000000A
#define _RPOR10_RP118R2_MASK                     0x00000400
#define _RPOR10_RP118R2_LENGTH                   0x00000001

#define _RPOR10_RP118R3_POSITION                 0x0000000B
#define _RPOR10_RP118R3_MASK                     0x00000800
#define _RPOR10_RP118R3_LENGTH                   0x00000001

#define _RPOR10_RP118R4_POSITION                 0x0000000C
#define _RPOR10_RP118R4_MASK                     0x00001000
#define _RPOR10_RP118R4_LENGTH                   0x00000001

#define _RPOR10_RP118R5_POSITION                 0x0000000D
#define _RPOR10_RP118R5_MASK                     0x00002000
#define _RPOR10_RP118R5_LENGTH                   0x00000001

#define _RPOR11_RP120R_POSITION                  0x00000000
#define _RPOR11_RP120R_MASK                      0x0000003F
#define _RPOR11_RP120R_LENGTH                    0x00000006

#define _RPOR11_RP125R_POSITION                  0x00000008
#define _RPOR11_RP125R_MASK                      0x00003F00
#define _RPOR11_RP125R_LENGTH                    0x00000006

#define _RPOR11_RP120R0_POSITION                 0x00000000
#define _RPOR11_RP120R0_MASK                     0x00000001
#define _RPOR11_RP120R0_LENGTH                   0x00000001

#define _RPOR11_RP120R1_POSITION                 0x00000001
#define _RPOR11_RP120R1_MASK                     0x00000002
#define _RPOR11_RP120R1_LENGTH                   0x00000001

#define _RPOR11_RP120R2_POSITION                 0x00000002
#define _RPOR11_RP120R2_MASK                     0x00000004
#define _RPOR11_RP120R2_LENGTH                   0x00000001

#define _RPOR11_RP120R3_POSITION                 0x00000003
#define _RPOR11_RP120R3_MASK                     0x00000008
#define _RPOR11_RP120R3_LENGTH                   0x00000001

#define _RPOR11_RP120R4_POSITION                 0x00000004
#define _RPOR11_RP120R4_MASK                     0x00000010
#define _RPOR11_RP120R4_LENGTH                   0x00000001

#define _RPOR11_RP120R5_POSITION                 0x00000005
#define _RPOR11_RP120R5_MASK                     0x00000020
#define _RPOR11_RP120R5_LENGTH                   0x00000001

#define _RPOR11_RP125R0_POSITION                 0x00000008
#define _RPOR11_RP125R0_MASK                     0x00000100
#define _RPOR11_RP125R0_LENGTH                   0x00000001

#define _RPOR11_RP125R1_POSITION                 0x00000009
#define _RPOR11_RP125R1_MASK                     0x00000200
#define _RPOR11_RP125R1_LENGTH                   0x00000001

#define _RPOR11_RP125R2_POSITION                 0x0000000A
#define _RPOR11_RP125R2_MASK                     0x00000400
#define _RPOR11_RP125R2_LENGTH                   0x00000001

#define _RPOR11_RP125R3_POSITION                 0x0000000B
#define _RPOR11_RP125R3_MASK                     0x00000800
#define _RPOR11_RP125R3_LENGTH                   0x00000001

#define _RPOR11_RP125R4_POSITION                 0x0000000C
#define _RPOR11_RP125R4_MASK                     0x00001000
#define _RPOR11_RP125R4_LENGTH                   0x00000001

#define _RPOR11_RP125R5_POSITION                 0x0000000D
#define _RPOR11_RP125R5_MASK                     0x00002000
#define _RPOR11_RP125R5_LENGTH                   0x00000001

#define _RPOR12_RP126R_POSITION                  0x00000000
#define _RPOR12_RP126R_MASK                      0x0000003F
#define _RPOR12_RP126R_LENGTH                    0x00000006

#define _RPOR12_RP127R_POSITION                  0x00000008
#define _RPOR12_RP127R_MASK                      0x00003F00
#define _RPOR12_RP127R_LENGTH                    0x00000006

#define _RPOR12_RP126R0_POSITION                 0x00000000
#define _RPOR12_RP126R0_MASK                     0x00000001
#define _RPOR12_RP126R0_LENGTH                   0x00000001

#define _RPOR12_RP126R1_POSITION                 0x00000001
#define _RPOR12_RP126R1_MASK                     0x00000002
#define _RPOR12_RP126R1_LENGTH                   0x00000001

#define _RPOR12_RP126R2_POSITION                 0x00000002
#define _RPOR12_RP126R2_MASK                     0x00000004
#define _RPOR12_RP126R2_LENGTH                   0x00000001

#define _RPOR12_RP126R3_POSITION                 0x00000003
#define _RPOR12_RP126R3_MASK                     0x00000008
#define _RPOR12_RP126R3_LENGTH                   0x00000001

#define _RPOR12_RP126R4_POSITION                 0x00000004
#define _RPOR12_RP126R4_MASK                     0x00000010
#define _RPOR12_RP126R4_LENGTH                   0x00000001

#define _RPOR12_RP126R5_POSITION                 0x00000005
#define _RPOR12_RP126R5_MASK                     0x00000020
#define _RPOR12_RP126R5_LENGTH                   0x00000001

#define _RPOR12_RP127R0_POSITION                 0x00000008
#define _RPOR12_RP127R0_MASK                     0x00000100
#define _RPOR12_RP127R0_LENGTH                   0x00000001

#define _RPOR12_RP127R1_POSITION                 0x00000009
#define _RPOR12_RP127R1_MASK                     0x00000200
#define _RPOR12_RP127R1_LENGTH                   0x00000001

#define _RPOR12_RP127R2_POSITION                 0x0000000A
#define _RPOR12_RP127R2_MASK                     0x00000400
#define _RPOR12_RP127R2_LENGTH                   0x00000001

#define _RPOR12_RP127R3_POSITION                 0x0000000B
#define _RPOR12_RP127R3_MASK                     0x00000800
#define _RPOR12_RP127R3_LENGTH                   0x00000001

#define _RPOR12_RP127R4_POSITION                 0x0000000C
#define _RPOR12_RP127R4_MASK                     0x00001000
#define _RPOR12_RP127R4_LENGTH                   0x00000001

#define _RPOR12_RP127R5_POSITION                 0x0000000D
#define _RPOR12_RP127R5_MASK                     0x00002000
#define _RPOR12_RP127R5_LENGTH                   0x00000001

#define _RPINR0_INT1R_POSITION                   0x00000008
#define _RPINR0_INT1R_MASK                       0x00007F00
#define _RPINR0_INT1R_LENGTH                     0x00000007

#define _RPINR0_INT1R0_POSITION                  0x00000008
#define _RPINR0_INT1R0_MASK                      0x00000100
#define _RPINR0_INT1R0_LENGTH                    0x00000001

#define _RPINR0_INT1R1_POSITION                  0x00000009
#define _RPINR0_INT1R1_MASK                      0x00000200
#define _RPINR0_INT1R1_LENGTH                    0x00000001

